{
    "sideBarData": {
        "title": "Ryan Bauermeister",
        "segment": [
            {
                "label": "Page Discription",
                "url": "",
                "icon": "fas fa-bars"
            },
            {
                "label": "Technologies",
                "url": "",
                "icon": "fas fa-cog"
            },
            {
                "label": "Github Files",
                "url": "",
                "icon": "fab fa-github"
            }
        ],
        "discription": "This  page is based on my resume and utilizes the technologies listed below.  All of the resume content is pulled from a JSON file.",
        "technologies": [
            "HTML",
            "JavaScript",
            "jQuery",
            "CSS",
            "Bootstrap",
            "JSON"
        ],
        "github": [
            {
                "label": "resume.js",
                "location": "https://github.com/ryan-bauermeister/Portfolio/blob/master/Resume/resume.js",
                "icon": "far fa-file"
            },
            {
                "label": "resume.css",
                "location": "https://github.com/ryan-bauermeister/Portfolio/blob/master/Resume/resume.css",
                "icon": "far fa-file"
            },
            {
                "label": "resume.html",
                "location": "https://github.com/ryan-bauermeister/Portfolio/blob/master/Resume/resume.html",
                "icon": "far fa-file"
            },
            {
                "label": "resume.json",
                "location": "https://github.com/ryan-bauermeister/Portfolio/blob/master/Resume/resume.json",
                "icon": "far fa-file"
            },
            {
                "label": "common.css",
                "location": "https://github.com/ryan-bauermeister/Portfolio/blob/master/Common/common.css",
                "icon": "far fa-file"
            },
            {
                "label": "common.js",
                "location": "https://github.com/ryan-bauermeister/Portfolio/blob/master/Common/common.js",
                "icon": "far fa-file"
            },
            {
                "label": "common.js",
                "location": "https://github.com/ryan-bauermeister/Portfolio/blob/master/Common/common.json",
                "icon": "far fa-file"
            }
        ]
    },
    "resumeData": {
        "fName": "Ryan",
        "lName": "Bauermeister",
        "address": "Apex, NC 27539",
        "phone": "919.500.****",
        "linkedin": "www.linkedin.com/in/rbauermeister",
        "email": "ryan.k.bauermeister@gmail.com",
        "introHeader1": "FRONT END DEVELOPMENT SPECIALIST",
        "introHeader2": "ANALYTICAL | SOLUTIONS-ORIENTED | CUSTOMER-FOCUSED",
        "intro1": "IT professional with notable success developing comprehensive and innovative solutions that support business objectives and resolve critical organization needs in IT, manufacturing and government.  Optimize resources in a timely and cost-effective manner.",
        "intro2": "Adaptable to fast-paced, ever-changing priorities and work environments. Clearly communicate complex concepts to technical and non-technical audiences.",
        "expertiseLabel": "Areas of expertise:",
        "expertise": [
            "Planning / Requirements Determination",
            "Implementation",
            "Software Analysis",
            "Software Testing",
            "Software Development",
            "Software / Database Integration",
            "Object-Oriented Design",
            "Application Security"
        ],
        "skillsHeader": "TECHNICAL SKILLS",
        "osLabel": "Operating Systems",
        "os": [
            "Windows",
            "Linux"
        ],
        "LanguagesLabel": "Programming Languages",
        "Languages": [
            "JavaScript",
            "HTML5",
            "CSS3",
            "jQuery",
            "Bootstrap",
            "Lodash",
            "PowerShell",
            "SQL",
            "LoopBack",
            "Angular",
            "JSON-Transforms",
            "C#",
            "Knockout"
        ],
        "dbLabel": "Data Technologies",
        "db": [
            "JSON",
            "XML",
            "MySQL",
            "DB2",
            "Oracle"
        ],
        "toolsLabel": "Tools",
        "tools": [
            "MS Visual Studio",
            "MS Visual Code",
            "SharePoint 2013",
            "AWS"
        ],
        "methodLabel": "Development Methodologies",
        "method": [
            "Agile (Scrum)",
            "Waterfall"
        ],
        "jobs": [
            {
                "experienceHeader": "PROFESSIONAL EXPERIENCE",
                "corp": "OCTO CONSULTING GROUP",
                "dates": "2016 to July 2018",
                "title": "Consultant",
                "location": "Reston, VA",
                "about": "Front End Development Specialist with experience in design and development of sites and code fragments.  Working as a member of an award winning Agile Scrum team supporting an application developed for the government.  As a member of this Agile team I designed, developed, tested, and provided maintenance for a wide range of JavaScript and custom UI fragments.",
                "examples": [
                    "Volunteered to create a graphing code fragment utilizing D3.js to provide pie and line graphs in addition to my scheduled project work.",
                    "Frequently made use of JavaScript to execute CRUD operations on SharePoint and MySQL data to support the needs of the application.",
                    "Created an image carousal code fragment to display a verity of text and images, this also included the logic to display the information in multiple formats and connecting to the SharePoint data.",
                    "Participated in the creation of an advanced search tool that included multiple data sources, filtering options, and the ability to save searches.",
                    "Created a reusable code fragment to provide the means to select users. This includes automatically filtering users and allowing for multiple selections to be added or removed also including the option to update ACL.",
                    "Utilized CSS and Bootstrap to enhance one of the main application pages to have a similar look and feel as the rest of the site.",
                    "Utilized server side JavaScript to provide formatting, filtering, and validation through loopback.",
                    "Regularly volunteered to pickup additional projects to assist in balancing the workload of the team.",
                    "Enhanced multiple code fragments to have the ability to support data analytics.",
                    "Volunteered to expand the scope of the Announcements Connectivity project and added additional REST API endpoints with the associated JavaScript logic to provide a more versatile solution for the client.",
                    "Frequently picked up new programming languages or tool in days needed to support a project."
                ]
            },
            {
                "experienceHeader": "ADDITIONAL RELEVANT EXPERIENCE",
                "corp": "IBM RESILIENCY SERVICES",
                "dates": "1999 to 2015",
                "title": "Senior IT Specialist",
                "location": "Research Triangle Park, NC",
                "about": "Oversaw full application development life cycle including requirements, design, development, testing, and maintenance of wide range of Lotus Notes applications.  Developed business process, change management, operations, and sales support applications.",
                "examples": [
                    "Drove development effort and implemented survey application that supported any language, providing customizable layout to over 70 countries, complex security needs, ties into web interface, and serving as key tool needed to improve services offered to customers and assist in identifying new opportunities.",
                    "Selected as lead developer for defining and implementing organizational change management process, creating and maintaining request tracking applications that coordinated and managed organizational IT development process and fulfilled critical need for complex business processes, prioritization, tracking, workflow, and audit compliance.",
                    "Integrated Notes applications with DB2, MS Excel spreadsheets, keeping data current across multiple platforms and allowing flexibility in manipulation large sets of data.",
                    "Recognized and received award for taking initiative and creating solution that supported requirements determination and approval process for high-value projects.",
                    "Designed innovative recovery instructions application to simulate SAP GUI, minimizing training needed for end users while meeting aggressive schedule / critical goals and implementing without issue.",
                    "Created and maintained multiple sales support applications for pricing, call tracking, customer information, and opportunity identification, serving as key components to sales organization, facilitating customer interaction, and providing accurate and timely pricing in winning new business."
                ]
            }
        ],
        "educationHeader": "EDUCATION",
        "degree": "Bachelor of Science (BS)",
        "major": "Management Information Systems",
        "university": "Indiana State University",
        "universityLocation": "Terre Haute, IN "
    }
}